# day 15

In [1]:
import pandas as pd
import numpy  as np

# merging two dataframes (concatenation)

# row merge and column merge

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [16]:
one=pd.DataFrame(data_one)
two=pd.DataFrame(data_two)
frames=[one,two]

In [17]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [18]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [19]:
data=pd.concat(frames)
data

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [20]:
pd.concat(frames,axis=1) #concatenate by columns

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

# inner merge

# inner merge is intersection: $$ A \cap B $$

In [22]:
registration=pd.DataFrame({"registration_id":[1,2,3,4],"names":["George","dick","Andrew","lazydick"]})
logins=pd.DataFrame({"login_id":[1,2,3,4],"names":["moth","jetix","George","dick"]})

In [23]:
registration

   registration_id     names
0                1    George
1                2      dick
2                3    Andrew
3                4  lazydick

In [24]:
logins

   login_id   names
0         1    moth
1         2   jetix
2         3  George
3         4    dick

In [25]:
result=pd.merge(left=registration,right=logins,how="inner",on="names")
result

   registration_id   names  login_id
0                1  George         3
1                2    dick         4

# left and right merge

# left merge A-B
# $$ (A + A \cap B) - B $$

In [26]:
registration

   registration_id     names
0                1    George
1                2      dick
2                3    Andrew
3                4  lazydick

In [27]:
logins

   login_id   names
0         1    moth
1         2   jetix
2         3  George
3         4    dick

In [29]:
result=pd.merge(left=registration,right=logins,how="left",on="names")
result

   registration_id     names  login_id
0                1    George       3.0
1                2      dick       4.0
2                3    Andrew       NaN
3                4  lazydick       NaN

# right merge B-A

# $$ (B + A \cap B) - A $$

In [31]:
result=pd.merge(left=registration,right=logins,how="right",on="names")
result

   registration_id   names  login_id
0              NaN    moth         1
1              NaN   jetix         2
2              1.0  George         3
3              2.0    dick         4

# outer merge

# outer merge is Union: $$ A\cup B $$

In [32]:
registration

   registration_id     names
0                1    George
1                2      dick
2                3    Andrew
3                4  lazydick

In [33]:
logins

   login_id   names
0         1    moth
1         2   jetix
2         3  George
3         4    dick

In [34]:
result=pd.merge(left=registration,right=logins,how="outer",on="names")
result

   registration_id     names  login_id
0              1.0    George       3.0
1              2.0      dick       4.0
2              3.0    Andrew       NaN
3              4.0  lazydick       NaN
4              NaN      moth       1.0
5              NaN     jetix       2.0

# changing the name of the column of the DataFrame

In [35]:
registration

   registration_id     names
0                1    George
1                2      dick
2                3    Andrew
3                4  lazydick

In [42]:
registration.columns=["id","names"]

In [43]:
registration

   id     names
0   1    George
1   2      dick
2   3    Andrew
3   4  lazydick

In [38]:
logins

   login_id   names
0         1    moth
1         2   jetix
2         3  George
3         4    dick

In [39]:
logins.columns=["id","names"]

In [40]:
logins

   id   names
0   1    moth
1   2   jetix
2   3  George
3   4    dick

# When we have id from two different DataFrames that are identical but each serve different purposes, pandas smartly categorize them as id_x, id_y

In [47]:
result=pd.merge(left=registration,right=logins,how="inner",on="names")
result

   id_x   names  id_y
0     1  George     3
1     2    dick     4

# We can however give our own suffixes to make the distinction stark.

In [48]:
result=pd.merge(left=registration,right=logins,how="inner",on="names",suffixes=("_reg","_log"))
result

   id_reg   names  id_log
0       1  George       3
1       2    dick       4

# Text methods for string data

In [49]:
email="george@greymoon.in"

In [50]:
email.split("@")

['george', 'greymoon.in']

In [56]:
names=pd.Series(["George","David","Dickson","Musthafa",'5','6'])

names.str.upper()

0      GEORGE
1       DAVID
2     DICKSON
3    MUSTHAFA
4           5
5           6
dtype: object

# lower casing the pandas series using string fucntion

In [57]:
names.str.lower()

0      george
1       david
2     dickson
3    musthafa
4           5
5           6
dtype: object

# checking to see if they are digits

In [58]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [65]:
comp=pd.Series(["L&T,TATA TELE SERVICES MAHARASTRA,TCS,INFY,MSFT,AMZN","sakthi Masala, Aachi Masala, Haaldiraams"])

# this creates a dataframe

In [66]:
comp.str.split(",",expand=True)

,0,1,2,3,4,5
0,L&T,TATA TELE SERVICES MAHARASTRA,TCS,INFY,MSFT,AMZN
1,sakthi Masala,Aachi Masala,Haaldiraams,None,None,None

In [67]:
comp.str.split(",")

0    [L&T, TATA TELE SERVICES MAHARASTRA, TCS, INFY...
1         [sakthi Masala,  Aachi Masala,  Haaldiraams]
dtype: object

In [68]:
comp.str.split(",")[0][2]

'TCS'

# clean the string

In [70]:
#note for Series initial S is caps

names=pd.Series(["Geor  :56  ","Dick$","Sucker  ","moorthy      ","Amul","rasa    athi   ","hick 567 up 34 ship"])
names

0            Geor  :56
1                  Dick$
2               Sucker
3          moorthy
4                   Amul
5        rasa    athi
6    hick 567 up 34 ship
dtype: object

In [80]:
# correct them all!

names=names.str.replace(["56","$","567","34","     ","    "],"").str.strip()
names

TypeError: unhashable type: 'list'

In [76]:
names=names.str.replace("$","")
names

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_16928\2665094037.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  names=names.str.replace("$ 567 34","")

0                   Geor
1                   Dick
2                 Sucker
3                moorthy
4                   Amul
5           rasa    athi
6    hick 567 up 34 ship
dtype: object

In [77]:
names=names.str.replace("567","")

In [78]:
names

0                Geor
1                Dick
2              Sucker
3             moorthy
4                Amul
5        rasa    athi
6    hick  up 34 ship
dtype: object

In [79]:
names=names.str.replace("34","")
names

0              Geor
1              Dick
2            Sucker
3           moorthy
4              Amul
5      rasa    athi
6    hick  up  ship
dtype: object

# day 22

# dealing with time and date in pandas

In [4]:
import numpy as np
import pandas as pd
from datetime import datetime

In [6]:
mydatetime=datetime(2023,1,18,16,48,53)

In [7]:
mydatetime

datetime.datetime(2023, 1, 18, 16, 48, 53)

In [8]:
mydatetime.year

2023

In [12]:
mydatetime.now

In [15]:
mydatetime=datetime.now()

In [18]:
mydatetime

datetime.datetime(2023, 1, 18, 16, 56, 40, 783004)

In [19]:
from datetime import datetime
import pytz

zones = pytz.all_timezones
zones

['Africa/Abidjan', 'Africa/Accra', 'Africa/Addis_Ababa', 'Africa/Algiers', 'Africa/Asmara', 'Africa/Asmera', 'Africa/Bamako', 'Africa/Bangui', 'Africa/Banjul', 'Africa/Bissau', 'Africa/Blantyre', 'Africa/Brazzaville', 'Africa/Bujumbura', 'Africa/Cairo', 'Africa/Casablanca', 'Africa/Ceuta', 'Africa/Conakry', 'Africa/Dakar', 'Africa/Dar_es_Salaam', 'Africa/Djibouti', 'Africa/Douala', 'Africa/El_Aaiun', 'Africa/Freetown', 'Africa/Gaborone', 'Africa/Harare', 'Africa/Johannesburg', 'Africa/Juba', 'Africa/Kampala', 'Africa/Khartoum', 'Africa/Kigali', 'Africa/Kinshasa', 'Africa/Lagos', 'Africa/Libreville', 'Africa/Lome', 'Africa/Luanda', 'Africa/Lubumbashi', 'Africa/Lusaka', 'Africa/Malabo', 'Africa/Maputo', 'Africa/Maseru', 'Africa/Mbabane', 'Africa/Mogadishu', 'Africa/Monrovia', 'Africa/Nairobi', 'Africa/Ndjamena', 'Africa/Niamey', 'Africa/Nouakchott', 'Africa/Ouagadougou', 'Africa/Porto-Novo', 'Africa/Sao_Tome', 'Africa/Timbuktu', 'Africa/Tripoli', 'Africa/Tunis', 'Africa/Windhoek', 'America/Adak', 'America/Anchorage', 'America/Anguilla', 'America/Antigua', 'America/Araguaina', 'America/Argentina/Buenos_Aires', 'America/Argentina/Catamarca', 'America/Argentina/ComodRivadavia', 'America/Argentina/Cordoba', 'America/Argentina/Jujuy', 'America/Argentina/La_Rioja', 'America/Argentina/Mendoza', 'America/Argentina/Rio_Gallegos', 'America/Argentina/Salta', 'America/Argentina/San_Juan', 'America/Argentina/San_Luis', 'America/Argentina/Tucuman', 'America/Argentina/Ushuaia', 'America/Aruba', 'America/Asuncion', 'America/Atikokan', 'America/Atka', 'America/Bahia', 'America/Bahia_Banderas', 'America/Barbados', 'America/Belem', 'America/Belize', 'America/Blanc-Sablon', 'America/Boa_Vista', 'America/Bogota', 'America/Boise', 'America/Buenos_Aires', 'America/Cambridge_Bay', 'America/Campo_Grande', 'America/Cancun', 'America/Caracas', 'America/Catamarca', 'America/Cayenne', 'America/Cayman', 'America/Chicago', 'America/Chihuahua', 'America/Coral_Harbour', 'America/Cordoba', 'America/Costa_Rica', 'America/Creston', 'America/Cuiaba', 'America/Curacao', 'America/Danmarkshavn', 'America/Dawson', 'America/Dawson_Creek', 'America/Denver', 'America/Detroit', 'America/Dominica', 'America/Edmonton', 'America/Eirunepe', 'America/El_Salvador', 'America/Ensenada', 'America/Fort_Nelson', 'America/Fort_Wayne', 'America/Fortaleza', 'America/Glace_Bay', 'America/Godthab', 'America/Goose_Bay', 'America/Grand_Turk', 'America/Grenada', 'America/Guadeloupe', 'America/Guatemala', 'America/Guayaquil', 'America/Guyana', 'America/Halifax', 'America/Havana', 'America/Hermosillo', 'America/Indiana/Indianapolis', 'America/Indiana/Knox', 'America/Indiana/Marengo', 'America/Indiana/Petersburg', 'America/Indiana/Tell_City', 'America/Indiana/Vevay', 'America/Indiana/Vincennes', 'America/Indiana/Winamac', 'America/Indianapolis', 'America/Inuvik', 'America/Iqaluit', 'America/Jamaica', 'America/Jujuy', 'America/Juneau', 'America/Kentucky/Louisville', 'America/Kentucky/Monticello', 'America/Knox_IN', 'America/Kralendijk', 'America/La_Paz', 'America/Lima', 'America/Los_Angeles', 'America/Louisville', 'America/Lower_Princes', 'America/Maceio', 'America/Managua', 'America/Manaus', 'America/Marigot', 'America/Martinique', 'America/Matamoros', 'America/Mazatlan', 'America/Mendoza', 'America/Menominee', 'America/Merida', 'America/Metlakatla', 'America/Mexico_City', 'America/Miquelon', 'America/Moncton', 'America/Monterrey', 'America/Montevideo', 'America/Montreal', 'America/Montserrat', 'America/Nassau', 'America/New_York', 'America/Nipigon', 'America/Nome', 'America/Noronha', 'America/North_Dakota/Beulah', 'America/North_Dakota/Center', 'America/North_Dakota/New_Salem', 'America/Nuuk', 'America/Ojinaga', 'America/Panama', 'America/Pangnirtung', 'America/Paramaribo', 'America/Phoenix', 'America/Port-au-Prince', 'America/Port_of_Spain', 'America/Porto_Acre', 'America/Porto_Velho', 'America/Puerto_Rico', 'America/Punta_Arenas', 'America/Rainy_River', 'America/Rankin_Inlet', 'America/Recife', 'America/Regina', 'America/Resolute', 'America/Rio_Branco', 'America/Rosario', 'America/Santa_Isabel', 'America/Santarem', 'America/Santiago', 'America/Santo_Domingo', 'America/Sao_Paulo', 'America/Scoresbysund', 'America/Shiprock', 'America/Sitka', 'America/St_Barthelemy', 'America/St_Johns', 'America/St_Kitts', 'America/St_Lucia', 'America/St_Thomas', 'America/St_Vincent', 'America/Swift_Current', 'America/Tegucigalpa', 'America/Thule', 'America/Thunder_Bay', 'America/Tijuana', 'America/Toronto', 'America/Tortola', 'America/Vancouver', 'America/Virgin', 'America/Whitehorse', 'America/Winnipeg', 'America/Yakutat', 'America/Yellowknife', 'Antarctica/Casey', 'Antarctica/Davis', 'Antarctica/DumontDUrville', 'Antarctica/Macquarie', 'Antarctica/Mawson', 'Antarctica/McMurdo', 'Antarctica/Palmer', 'Antarctica/Rothera', 'Antarctica/South_Pole', 'Antarctica/Syowa', 'Antarctica/Troll', 'Antarctica/Vostok', 'Arctic/Longyearbyen', 'Asia/Aden', 'Asia/Almaty', 'Asia/Amman', 'Asia/Anadyr', 'Asia/Aqtau', 'Asia/Aqtobe', 'Asia/Ashgabat', 'Asia/Ashkhabad', 'Asia/Atyrau', 'Asia/Baghdad', 'Asia/Bahrain', 'Asia/Baku', 'Asia/Bangkok', 'Asia/Barnaul', 'Asia/Beirut', 'Asia/Bishkek', 'Asia/Brunei', 'Asia/Calcutta', 'Asia/Chita', 'Asia/Choibalsan', 'Asia/Chongqing', 'Asia/Chungking', 'Asia/Colombo', 'Asia/Dacca', 'Asia/Damascus', 'Asia/Dhaka', 'Asia/Dili', 'Asia/Dubai', 'Asia/Dushanbe', 'Asia/Famagusta', 'Asia/Gaza', 'Asia/Harbin', 'Asia/Hebron', 'Asia/Ho_Chi_Minh', 'Asia/Hong_Kong', 'Asia/Hovd', 'Asia/Irkutsk', 'Asia/Istanbul', 'Asia/Jakarta', 'Asia/Jayapura', 'Asia/Jerusalem', 'Asia/Kabul', 'Asia/Kamchatka', 'Asia/Karachi', 'Asia/Kashgar', 'Asia/Kathmandu', 'Asia/Katmandu', 'Asia/Khandyga', 'Asia/Kolkata', 'Asia/Krasnoyarsk', 'Asia/Kuala_Lumpur', 'Asia/Kuching', 'Asia/Kuwait', 'Asia/Macao', 'Asia/Macau', 'Asia/Magadan', 'Asia/Makassar', 'Asia/Manila', 'Asia/Muscat', 'Asia/Nicosia', 'Asia/Novokuznetsk', 'Asia/Novosibirsk', 'Asia/Omsk', 'Asia/Oral', 'Asia/Phnom_Penh', 'Asia/Pontianak', 'Asia/Pyongyang', 'Asia/Qatar', 'Asia/Qostanay', 'Asia/Qyzylorda', 'Asia/Rangoon', 'Asia/Riyadh', 'Asia/Saigon', 'Asia/Sakhalin', 'Asia/Samarkand', 'Asia/Seoul', 'Asia/Shanghai', 'Asia/Singapore', 'Asia/Srednekolymsk', 'Asia/Taipei', 'Asia/Tashkent', 'Asia/Tbilisi', 'Asia/Tehran', 'Asia/Tel_Aviv', 'Asia/Thimbu', 'Asia/Thimphu', 'Asia/Tokyo', 'Asia/Tomsk', 'Asia/Ujung_Pandang', 'Asia/Ulaanbaatar', 'Asia/Ulan_Bator', 'Asia/Urumqi', 'Asia/Ust-Nera', 'Asia/Vientiane', 'Asia/Vladivostok', 'Asia/Yakutsk', 'Asia/Yangon', 'Asia/Yekaterinburg', 'Asia/Yerevan', 'Atlantic/Azores', 'Atlantic/Bermuda', 'Atlantic/Canary', 'Atlantic/Cape_Verde', 'Atlantic/Faeroe', 'Atlantic/Faroe', 'Atlantic/Jan_Mayen', 'Atlantic/Madeira', 'Atlantic/Reykjavik', 'Atlantic/South_Georgia', 'Atlantic/St_Helena', 'Atlantic/Stanley', 'Australia/ACT', 'Australia/Adelaide', 'Australia/Brisbane', 'Australia/Broken_Hill', 'Australia/Canberra', 'Australia/Currie', 'Australia/Darwin', 'Australia/Eucla', 'Australia/Hobart', 'Australia/LHI', 'Australia/Lindeman', 'Australia/Lord_Howe', 'Australia/Melbourne', 'Australia/NSW', 'Australia/North', 'Australia/Perth', 'Australia/Queensland', 'Australia/South', 'Australia/Sydney', 'Australia/Tasmania', 'Australia/Victoria', 'Australia/West', 'Australia/Yancowinna', 'Brazil/Acre', 'Brazil/DeNoronha', 'Brazil/East', 'Brazil/West', 'CET', 'CST6CDT', 'Canada/Atlantic', 'Canada/Central', 'Canada/Eastern', 'Canada/Mountain', 'Canada/Newfoundland', 'Canada/Pacific', 'Canada/Saskatchewan', 'Canada/Yukon', 'Chile/Continental', 'Chile/EasterIsland', 'Cuba', 'EET', 'EST', 'EST5EDT', 'Egypt', 'Eire', 'Etc/GMT', 'Etc/GMT+0', 'Etc/GMT+1', 'Etc/GMT+10', 'Etc/GMT+11', 'Etc/GMT+12', 'Etc/GMT+2', 'Etc/GMT+3', 'Etc/GMT+4', 'Etc/GMT+5', 'Etc/GMT+6', 'Etc/GMT+7', 'Etc/GMT+8', 'Etc/GMT+9', 'Etc/GMT-0', 'Etc/GMT-1', 'Etc/GMT-10', 'Etc/GMT-11', 'Etc/GMT-12', 'Etc/GMT-13', 'Etc/GMT-14', 'Etc/GMT-2', 'Etc/GMT-3', 'Etc/GMT-4', 'Etc/GMT-5', 'Etc/GMT-6', 'Etc/GMT-7', 'Etc/GMT-8', 'Etc/GMT-9', 'Etc/GMT0', 'Etc/Greenwich', 'Etc/UCT', 'Etc/UTC', 'Etc/Universal', 'Etc/Zulu', 'Europe/Amsterdam', 'Europe/Andorra', 'Europe/Astrakhan', 'Europe/Athens', 'Europe/Belfast', 'Europe/Belgrade', 'Europe/Berlin', 'Europe/Bratislava', 'Europe/Brussels', 'Europe/Bucharest', 'Europe/Budapest', 'Europe/Busingen', 'Europe/Chisinau', 'Europe/Copenhagen', 'Europe/Dublin', 'Europe/Gibraltar', 'Europe/Guernsey', 'Europe/Helsinki', 'Europe/Isle_of_Man', 'Europe/Istanbul', 'Europe/Jersey', 'Europe/Kaliningrad', 'Europe/Kiev', 'Europe/Kirov', 'Europe/Lisbon', 'Europe/Ljubljana', 'Europe/London', 'Europe/Luxembourg', 'Europe/Madrid', 'Europe/Malta', 'Europe/Mariehamn', 'Europe/Minsk', 'Europe/Monaco', 'Europe/Moscow', 'Europe/Nicosia', 'Europe/Oslo', 'Europe/Paris', 'Europe/Podgorica', 'Europe/Prague', 'Europe/Riga', 'Europe/Rome', 'Europe/Samara', 'Europe/San_Marino', 'Europe/Sarajevo', 'Europe/Saratov', 'Europe/Simferopol', 'Europe/Skopje', 'Europe/Sofia', 'Europe/Stockholm', 'Europe/Tallinn', 'Europe/Tirane', 'Europe/Tiraspol', 'Europe/Ulyanovsk', 'Europe/Uzhgorod', 'Europe/Vaduz', 'Europe/Vatican', 'Europe/Vienna', 'Europe/Vilnius', 'Europe/Volgograd', 'Europe/Warsaw', 'Europe/Zagreb', 'Europe/Zaporozhye', 'Europe/Zurich', 'GB', 'GB-Eire', 'GMT', 'GMT+0', 'GMT-0', 'GMT0', 'Greenwich', 'HST', 'Hongkong', 'Iceland', 'Indian/Antananarivo', 'Indian/Chagos', 'Indian/Christmas', 'Indian/Cocos', 'Indian/Comoro', 'Indian/Kerguelen', 'Indian/Mahe', 'Indian/Maldives', 'Indian/Mauritius', 'Indian/Mayotte', 'Indian/Reunion', 'Iran', 'Israel', 'Jamaica', 'Japan', 'Kwajalein', 'Libya', 'MET', 'MST', 'MST7MDT', 'Mexico/BajaNorte', 'Mexico/BajaSur', 'Mexico/General', 'NZ', 'NZ-CHAT', 'Navajo', 'PRC', 'PST8PDT', 'Pacific/Apia', 'Pacific/Auckland', 'Pacific/Bougainville', 'Pacific/Chatham', 'Pacific/Chuuk', 'Pacific/Easter', 'Pacific/Efate', 'Pacific/Enderbury', 'Pacific/Fakaofo', 'Pacific/Fiji', 'Pacific/Funafuti', 'Pacific/Galapagos', 'Pacific/Gambier', 'Pacific/Guadalcanal', 'Pacific/Guam', 'Pacific/Honolulu', 'Pacific/Johnston', 'Pacific/Kanton', 'Pacific/Kiritimati', 'Pacific/Kosrae', 'Pacific/Kwajalein', 'Pacific/Majuro', 'Pacific/Marquesas', 'Pacific/Midway', 'Pacific/Nauru', 'Pacific/Niue', 'Pacific/Norfolk', 'Pacific/Noumea', 'Pacific/Pago_Pago', 'Pacific/Palau', 'Pacific/Pitcairn', 'Pacific/Pohnpei', 'Pacific/Ponape', 'Pacific/Port_Moresby', 'Pacific/Rarotonga', 'Pacific/Saipan', 'Pacific/Samoa', 'Pacific/Tahiti', 'Pacific/Tarawa', 'Pacific/Tongatapu', 'Pacific/Truk', 'Pacific/Wake', 'Pacific/Wallis', 'Pacific/Yap', 'Poland', 'Portugal', 'ROC', 'ROK', 'Singapore', 'Turkey', 'UCT', 'US/Alaska', 'US/Aleutian', 'US/Arizona', 'US/Central', 'US/East-Indiana', 'US/Eastern', 'US/Hawaii', 'US/Indiana-Starke', 'US/Michigan', 'US/Mountain', 'US/Pacific', 'US/Samoa', 'UTC', 'Universal', 'W-SU', 'WET', 'Zulu']

In [25]:
myser=pd.Series(["jan 5, 1998","28-05-2001","nov 3, 1990"])

myser

0    jan 5, 1998
1     28-05-2001
2    nov 3, 1990
dtype: object

In [23]:
myser[0].year

AttributeError: 'str' object has no attribute 'year'

In [27]:
pd.to_datetime(myser,infer_datetime_format= True)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_12232\1316679639.py:1: UserWarning: Parsing '28-05-2001' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  pd.to_datetime(myser,infer_datetime_format= True)

0   1998-01-05
1   2001-05-28
2   1990-11-03
dtype: datetime64[ns]

In [28]:
euro_date="05-01-1998"

pd.to_datetime(euro_date,dayfirst=True)

Timestamp('1998-01-05 00:00:00')

In [35]:
styledate= "01--05--1998"

# m for month. d for date. Y for year
pd.to_datetime(styledate,format="%m--%d--%Y")

Timestamp('1998-01-05 00:00:00')

In [36]:
styledate= "jan--05--1998"

# b for month. d for date. Y for year
pd.to_datetime(styledate,format="%b--%d--%Y")

Timestamp('1998-01-05 00:00:00')

In [37]:
fuckdate="12th of dec 2001"

pd.to_datetime(fuckdate)

Timestamp('2001-12-12 00:00:00')

In [38]:
sales=pd.read_csv("RetailSales_BeerWineLiquor.csv")

In [39]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [42]:
sales['DATE']=pd.to_datetime(sales["DATE"])

In [43]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [44]:
sales["DATE"][0].year

1992

In [45]:
sales.sample(10)

          DATE  MRTSSM4453USN
286 2015-11-01           4266
142 2003-11-01           2660
34  1994-11-01           1845
59  1996-12-01           2547
312 2018-01-01           3991
295 2016-08-01           4475
191 2007-12-01           4403
131 2002-12-01           3488
89  1999-06-01           2145
54  1996-07-01           2034

# parse dates upon opening the file

In [46]:
sales=pd.read_csv("RetailSales_BeerWineLiquor.csv",parse_dates=[0])

In [47]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [48]:
sales.sample(10)

          DATE  MRTSSM4453USN
103 2000-08-01           2422
57  1996-10-01           1860
85  1999-02-01           1808
98  2000-03-01           2190
46  1995-11-01           1879
269 2014-06-01           4036
54  1996-07-01           2034
245 2012-06-01           3816
299 2016-12-01           6057
250 2012-11-01           3869

In [50]:
sales.groupby("DATE").mean()

            MRTSSM4453USN
DATE
1992-01-01         1509.0
1992-02-01         1541.0
1992-03-01         1597.0
1992-04-01         1675.0
1992-05-01         1822.0
...                   ...
2019-12-01         6630.0
2020-01-01         4388.0
2020-02-01         4533.0
2020-03-01         5562.0
2020-04-01         5207.0

[340 rows x 1 columns]

In [51]:
sales["DATE"].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [52]:
sales["DATE"].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64

In [55]:
help(sales["DATE"].dt)

Help on DatetimeProperties in module pandas.core.indexes.accessors object:

class DatetimeProperties(Properties)
 |  DatetimeProperties(data: 'Series', orig)
 |
 |  Accessor object for datetimelike properties of the Series values.
 |
 |  Examples
 |  --------
 |  >>> seconds_series = pd.Series(pd.date_range("2000-01-01", periods=3, freq="s"))
 |  >>> seconds_series
 |  0   2000-01-01 00:00:00
 |  1   2000-01-01 00:00:01
 |  2   2000-01-01 00:00:02
 |  dtype: datetime64[ns]
 |  >>> seconds_series.dt.second
 |  0    0
 |  1    1
 |  2    2
 |  dtype: int64
 |
 |  >>> hours_series = pd.Series(pd.date_range("2000-01-01", periods=3, freq="h"))
 |  >>> hours_series
 |  0   2000-01-01 00:00:00
 |  1   2000-01-01 01:00:00
 |  2   2000-01-01 02:00:00
 |  dtype: datetime64[ns]
 |  >>> hours_series.dt.hour
 |  0    0
 |  1    1
 |  2    2
 |  dtype: int64
 |
 |  >>> quarters_series = pd.Series(pd.date_range("2000-01-01", periods=3, freq="q"))
 |  >>> quarters_series
 |  0   2000-03-31
 |  1   2000-06-30
 |  2   2000-09-30
 |  dtype: datetime64[ns]
 |  >>> quarters_series.dt.quarter
 |  0    1
 |  1    2
 |  2    3
 |  dtype: int64
 |
 |  Returns a Series indexed like the original Series.
 |  Raises TypeError if the Series does not contain datetimelike values.
 |
 |  Method resolution order:
 |      DatetimeProperties
 |      Properties
 |      pandas.core.accessor.PandasDelegate
 |      pandas.core.base.PandasObject
 |      pandas.core.accessor.DirNamesMixin
 |      pandas.core.base.NoNewAttributesMixin
 |      builtins.object
 |
 |  Methods defined here:
 |
 |  ceil(self, *args, **kwargs)
 |      Perform ceil operation on the data to the specified `freq`.
 |
 |      Parameters
 |      ----------
 |      freq : str or Offset
 |          The frequency level to ceil the index to. Must be a fixed
 |          frequency like 'S' (second) not 'ME' (month end). See
 |          :ref:`frequency aliases <timeseries.offset_aliases>` for
 |          a list of possible `freq` values.
 |      ambiguous : 'infer', bool-ndarray, 'NaT', default 'raise'
 |          Only relevant for DatetimeIndex:
 |
 |          - 'infer' will attempt to infer fall dst-transition hours based on
 |            order
 |          - bool-ndarray where True signifies a DST time, False designates
 |            a non-DST time (note that this flag is only applicable for
 |            ambiguous times)
 |          - 'NaT' will return NaT where there are ambiguous times
 |          - 'raise' will raise an AmbiguousTimeError if there are ambiguous
 |            times.
 |
 |      nonexistent : 'shift_forward', 'shift_backward', 'NaT', timedelta, default 'raise'
 |          A nonexistent time does not exist in a particular timezone
 |          where clocks moved forward due to DST.
 |
 |          - 'shift_forward' will shift the nonexistent time forward to the
 |            closest existing time
 |          - 'shift_backward' will shift the nonexistent time backward to the
 |            closest existing time
 |          - 'NaT' will return NaT where there are nonexistent times
 |          - timedelta objects will shift nonexistent times by the timedelta
 |          - 'raise' will raise an NonExistentTimeError if there are
 |            nonexistent times.
 |
 |      Returns
 |      -------
 |      DatetimeIndex, TimedeltaIndex, or Series
 |          Index of the same type for a DatetimeIndex or TimedeltaIndex,
 |          or a Series with the same index for a Series.
 |
 |      Raises
 |      ------
 |      ValueError if the `freq` cannot be converted.
 |
 |      Notes
 |      -----
 |      If the timestamps have a timezone, ceiling will take place relative to the
 |      local ("wall") time and re-localized to the same timezone. When ceiling
 |      near daylight savings time, use ``nonexistent`` and ``ambiguous`` to
 |      control the re-localization behavior.
 |
 |      Examples
 |      --------
 |      **DatetimeIndex**
 |
 |      >>> rng = pd.date_range('1/1/2018 11:59:00', periods=3, freq='min')
 |      >>> rng
 |      DatetimeIndex(['2018-01-01 11:59:00', '2018-01-01 12:00:00',
 |                     '2018-01-01 12:01:00'],
 |                    dtype='datetime64[ns]', freq='T')
 |      >>> rng.ceil('H')
 |      DatetimeIndex(['2018-01-01 12:00:00', '2018-01-01 12:00:00',
 |                     '2018-01-01 13:00:00'],
 |                    dtype='datetime64[ns]', freq=None)
 |
 |      **Series**
 |
 |      >>> pd.Series(rng).dt.ceil("H")
 |      0   2018-01-01 12:00:00
 |      1   2018-01-01 12:00:00
 |      2   2018-01-01 13:00:00
 |      dtype: datetime64[ns]
 |
 |      When rounding near a daylight savings time transition, use ``ambiguous`` or
 |      ``nonexistent`` to control how the timestamp should be re-localized.
 |
 |      >>> rng_tz = pd.DatetimeIndex(["2021-10-31 01:30:00"], tz="Europe/Amsterdam")
 |
 |      >>> rng_tz.ceil("H", ambiguous=False)
 |      DatetimeIndex(['2021-10-31 02:00:00+01:00'],
 |                    dtype='datetime64[ns, Europe/Amsterdam]', freq=None)
 |
 |      >>> rng_tz.ceil("H", ambiguous=True)
 |      DatetimeIndex(['2021-10-31 02:00:00+02:00'],
 |                    dtype='datetime64[ns, Europe/Amsterdam]', freq=None)
 |
 |  day_name(self, *args, **kwargs)
 |      Return the day names of the DateTimeIndex with specified locale.
 |
 |      Parameters
 |      ----------
 |      locale : str, optional
 |          Locale determining the language in which to return the day name.
 |          Default is English locale.
 |
 |      Returns
 |      -------
 |      Index
 |          Index of day names.
 |
 |      Examples
 |      --------
 |      >>> idx = pd.date_range(start='2018-01-01', freq='D', periods=3)
 |      >>> idx
 |      DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03'],
 |                    dtype='datetime64[ns]', freq='D')
 |      >>> idx.day_name()
 |      Index(['Monday', 'Tuesday', 'Wednesday'], dtype='object')
 |
 |  floor(self, *args, **kwargs)
 |      Perform floor operation on the data to the specified `freq`.
 |
 |      Parameters
 |      ----------
 |      freq : str or Offset
 |          The frequency level to floor the index to. Must be a fixed
 |          frequency like 'S' (second) not 'ME' (month end). See
 |          :ref:`frequency aliases <timeseries.offset_aliases>` for
 |          a list of possible `freq` values.
 |      ambiguous : 'infer', bool-ndarray, 'NaT', default 'raise'
 |          Only relevant for DatetimeIndex:
 |
 |          - 'infer' will attempt to infer fall dst-transition hours based on
 |            order
 |          - bool-ndarray where True signifies a DST time, False designates
 |            a non-DST time (note that this flag is only applicable for
 |            ambiguous times)
 |          - 'NaT' will return NaT where there are ambiguous times
 |          - 'raise' will raise an AmbiguousTimeError if there are ambiguous
 |            times.
 |
 |      nonexistent : 'shift_forward', 'shift_backward', 'NaT', timedelta, default 'raise'
 |          A nonexistent time does not exist in a particular timezone
 |          where clocks moved forward due to DST.
 |
 |          - 'shift_forward' will shift the nonexistent time forward to the
 |            closest existing time
 |          - 'shift_backward' will shift the nonexistent time backward to the
 |            closest existing time
 |          - 'NaT' will return NaT where there are nonexistent times
 |          - timedelta objects will shift nonexistent times by the timedelta
 |          - 'raise' will raise an NonExistentTimeError if there are
 |            nonexistent times.
 |
 |      Returns
 |      -------
 |      DatetimeIndex, TimedeltaIndex, or Series
 |          Index of the same type for a DatetimeIndex or TimedeltaIndex,
 |          or a Series with the same index for a Series.
 |
 |      Raises
 |      ------
 |      ValueError if the `freq` cannot be converted.
 |
 |      Notes
 |      -----
 |      If the timestamps have a timezone, flooring will take place relative to the
 |      local ("wall") time and re-localized to the same timezone. When flooring
 |      near daylight savings time, use ``nonexistent`` and ``ambiguous`` to
 |      control the re-localization behavior.
 |
 |      Examples
 |      --------
 |      **DatetimeIndex**
 |
 |      >>> rng = pd.date_range('1/1/2018 11:59:00', periods=3, freq='min')
 |      >>> rng
 |      DatetimeIndex(['2018-01-01 11:59:00', '2018-01-01 12:00:00',
 |                     '2018-01-01 12:01:00'],
 |                    dtype='datetime64[ns]', freq='T')
 |      >>> rng.floor('H')
 |      DatetimeIndex(['2018-01-01 11:00:00', '2018-01-01 12:00:00',
 |                     '2018-01-01 12:00:00'],
 |                    dtype='datetime64[ns]', freq=None)
 |
 |      **Series**
 |
 |      >>> pd.Series(rng).dt.floor("H")
 |      0   2018-01-01 11:00:00
 |      1   2018-01-01 12:00:00
 |      2   2018-01-01 12:00:00
 |      dtype: datetime64[ns]
 |
 |      When rounding near a daylight savings time transition, use ``ambiguous`` or
 |      ``nonexistent`` to control how the timestamp should be re-localized.
 |
 |      >>> rng_tz = pd.DatetimeIndex(["2021-10-31 03:30:00"], tz="Europe/Amsterdam")
 |
 |      >>> rng_tz.floor("2H", ambiguous=False)
 |      DatetimeIndex(['2021-10-31 02:00:00+01:00'],
 |                   dtype='datetime64[ns, Europe/Amsterdam]', freq=None)
 |
 |      >>> rng_tz.floor("2H", ambiguous=True)
 |      DatetimeIndex(['2021-10-31 02:00:00+02:00'],
 |                    dtype='datetime64[ns, Europe/Amsterdam]', freq=None)
 |
 |  isocalendar(self)
 |      Returns a DataFrame with the year, week, and day calculated according to
 |      the ISO 8601 standard.
 |
 |      .. versionadded:: 1.1.0
 |
 |      Returns
 |      -------
 |      DataFrame
 |          with columns year, week and day
 |
 |      See Also
 |      --------
 |      Timestamp.isocalendar : Function return a 3-tuple containing ISO year,
 |          week number, and weekday for the given Timestamp object.
 |      datetime.date.isocalendar : Return a named tuple object with
 |          three components: year, week and weekday.
 |
 |      Examples
 |      --------
 |      >>> ser = pd.to_datetime(pd.Series(["2010-01-01", pd.NaT]))
 |      >>> ser.dt.isocalendar()
 |         year  week  day
 |      0  2009    53     5
 |      1  <NA>  <NA>  <NA>
 |      >>> ser.dt.isocalendar().week
 |      0      53
 |      1    <NA>
 |      Name: week, dtype: UInt32
 |
 |  month_name(self, *args, **kwargs)
 |      Return the month names of the DateTimeIndex with specified locale.
 |
 |      Parameters
 |      ----------
 |      locale : str, optional
 |          Locale determining the language in which to return the month name.
 |          Default is English locale.
 |
 |      Returns
 |      -------
 |      Index
 |          Index of month names.
 |
 |      Examples
 |      --------
 |      >>> idx = pd.date_range(start='2018-01', freq='M', periods=3)
 |      >>> idx
 |      DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31'],
 |                    dtype='datetime64[ns]', freq='M')
 |      >>> idx.month_name()
 |      Index(['January', 'February', 'March'], dtype='object')
 |
 |  normalize(self, *args, **kwargs)
 |      Convert times to midnight.
 |
 |      The time component of the date-time is converted to midnight i.e.
 |      00:00:00. This is useful in cases, when the time does not matter.
 |      Length is unaltered. The timezones are unaffected.
 |
 |      This method is available on Series with datetime values under
 |      the ``.dt`` accessor, and directly on Datetime Array/Index.
 |
 |      Returns
 |      -------
 |      DatetimeArray, DatetimeIndex or Series
 |          The same type as the original data. Series will have the same
 |          name and index. DatetimeIndex will have the same name.
 |
 |      See Also
 |      --------
 |      floor : Floor the datetimes to the specified freq.
 |      ceil : Ceil the datetimes to the specified freq.
 |      round : Round the datetimes to the specified freq.
 |
 |      Examples
 |      --------
 |      >>> idx = pd.date_range(start='2014-08-01 10:00', freq='H',
 |      ...                     periods=3, tz='Asia/Calcutta')
 |      >>> idx
 |      DatetimeIndex(['2014-08-01 10:00:00+05:30',
 |                     '2014-08-01 11:00:00+05:30',
 |                     '2014-08-01 12:00:00+05:30'],
 |                      dtype='datetime64[ns, Asia/Calcutta]', freq='H')
 |      >>> idx.normalize()
 |      DatetimeIndex(['2014-08-01 00:00:00+05:30',
 |                     '2014-08-01 00:00:00+05:30',
 |                     '2014-08-01 00:00:00+05:30'],
 |                     dtype='datetime64[ns, Asia/Calcutta]', freq=None)
 |
 |  round(self, *args, **kwargs)
 |      Perform round operation on the data to the specified `freq`.
 |
 |      Parameters
 |      ----------
 |      freq : str or Offset
 |          The frequency level to round the index to. Must be a fixed
 |          frequency like 'S' (second) not 'ME' (month end). See
 |          :ref:`frequency aliases <timeseries.offset_aliases>` for
 |          a list of possible `freq` values.
 |      ambiguous : 'infer', bool-ndarray, 'NaT', default 'raise'
 |          Only relevant for DatetimeIndex:
 |
 |          - 'infer' will attempt to infer fall dst-transition hours based on
 |            order
 |          - bool-ndarray where True signifies a DST time, False designates
 |            a non-DST time (note that this flag is only applicable for
 |            ambiguous times)
 |          - 'NaT' will return NaT where there are ambiguous times
 |          - 'raise' will raise an AmbiguousTimeError if there are ambiguous
 |            times.
 |
 |      nonexistent : 'shift_forward', 'shift_backward', 'NaT', timedelta, default 'raise'
 |          A nonexistent time does not exist in a particular timezone
 |          where clocks moved forward due to DST.
 |
 |          - 'shift_forward' will shift the nonexistent time forward to the
 |            closest existing time
 |          - 'shift_backward' will shift the nonexistent time backward to the
 |            closest existing time
 |          - 'NaT' will return NaT where there are nonexistent times
 |          - timedelta objects will shift nonexistent times by the timedelta
 |          - 'raise' will raise an NonExistentTimeError if there are
 |            nonexistent times.
 |
 |      Returns
 |      -------
 |      DatetimeIndex, TimedeltaIndex, or Series
 |          Index of the same type for a DatetimeIndex or TimedeltaIndex,
 |          or a Series with the same index for a Series.
 |
 |      Raises
 |      ------
 |      ValueError if the `freq` cannot be converted.
 |
 |      Notes
 |      -----
 |      If the timestamps have a timezone, rounding will take place relative to the
 |      local ("wall") time and re-localized to the same timezone. When rounding
 |      near daylight savings time, use ``nonexistent`` and ``ambiguous`` to
 |      control the re-localization behavior.
 |
 |      Examples
 |      --------
 |      **DatetimeIndex**
 |
 |      >>> rng = pd.date_range('1/1/2018 11:59:00', periods=3, freq='min')
 |      >>> rng
 |      DatetimeIndex(['2018-01-01 11:59:00', '2018-01-01 12:00:00',
 |                     '2018-01-01 12:01:00'],
 |                    dtype='datetime64[ns]', freq='T')
 |      >>> rng.round('H')
 |      DatetimeIndex(['2018-01-01 12:00:00', '2018-01-01 12:00:00',
 |                     '2018-01-01 12:00:00'],
 |                    dtype='datetime64[ns]', freq=None)
 |
 |      **Series**
 |
 |      >>> pd.Series(rng).dt.round("H")
 |      0   2018-01-01 12:00:00
 |      1   2018-01-01 12:00:00
 |      2   2018-01-01 12:00:00
 |      dtype: datetime64[ns]
 |
 |      When rounding near a daylight savings time transition, use ``ambiguous`` or
 |      ``nonexistent`` to control how the timestamp should be re-localized.
 |
 |      >>> rng_tz = pd.DatetimeIndex(["2021-10-31 03:30:00"], tz="Europe/Amsterdam")
 |
 |      >>> rng_tz.floor("2H", ambiguous=False)
 |      DatetimeIndex(['2021-10-31 02:00:00+01:00'],
 |                    dtype='datetime64[ns, Europe/Amsterdam]', freq=None)
 |
 |      >>> rng_tz.floor("2H", ambiguous=True)
 |      DatetimeIndex(['2021-10-31 02:00:00+02:00'],
 |                    dtype='datetime64[ns, Europe/Amsterdam]', freq=None)
 |
 |  strftime(self, *args, **kwargs)
 |      Convert to Index using specified date_format.
 |
 |      Return an Index of formatted strings specified by date_format, which
 |      supports the same string format as the python standard library. Details
 |      of the string format can be found in `python string format
 |      doc <https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior>`__.
 |
 |      Parameters
 |      ----------
 |      date_format : str
 |          Date format string (e.g. "%Y-%m-%d").
 |
 |      Returns
 |      -------
 |      ndarray[object]
 |          NumPy ndarray of formatted strings.
 |
 |      See Also
 |      --------
 |      to_datetime : Convert the given argument to datetime.
 |      DatetimeIndex.normalize : Return DatetimeIndex with times to midnight.
 |      DatetimeIndex.round : Round the DatetimeIndex to the specified freq.
 |      DatetimeIndex.floor : Floor the DatetimeIndex to the specified freq.
 |
 |      Examples
 |      --------
 |      >>> rng = pd.date_range(pd.Timestamp("2018-03-10 09:00"),
 |      ...                     periods=3, freq='s')
 |      >>> rng.strftime('%B %d, %Y, %r')
 |      Index(['March 10, 2018, 09:00:00 AM', 'March 10, 2018, 09:00:01 AM',
 |             'March 10, 2018, 09:00:02 AM'],
 |            dtype='object')
 |
 |  to_period(self, *args, **kwargs)
 |      Cast to PeriodArray/Index at a particular frequency.
 |
 |      Converts DatetimeArray/Index to PeriodArray/Index.
 |
 |      Parameters
 |      ----------
 |      freq : str or Offset, optional
 |          One of pandas' :ref:`offset strings <timeseries.offset_aliases>`
 |          or an Offset object. Will be inferred by default.
 |
 |      Returns
 |      -------
 |      PeriodArray/Index
 |
 |      Raises
 |      ------
 |      ValueError
 |          When converting a DatetimeArray/Index with non-regular values,
 |          so that a frequency cannot be inferred.
 |
 |      See Also
 |      --------
 |      PeriodIndex: Immutable ndarray holding ordinal values.
 |      DatetimeIndex.to_pydatetime: Return DatetimeIndex as object.
 |
 |      Examples
 |      --------
 |      >>> df = pd.DataFrame({"y": [1, 2, 3]},
 |      ...                   index=pd.to_datetime(["2000-03-31 00:00:00",
 |      ...                                         "2000-05-31 00:00:00",
 |      ...                                         "2000-08-31 00:00:00"]))
 |      >>> df.index.to_period("M")
 |      PeriodIndex(['2000-03', '2000-05', '2000-08'],
 |                  dtype='period[M]')
 |
 |      Infer the daily frequency
 |
 |      >>> idx = pd.date_range("2017-01-01", periods=2)
 |      >>> idx.to_period()
 |      PeriodIndex(['2017-01-01', '2017-01-02'],
 |                  dtype='period[D]')
 |
 |  to_pydatetime(self) -> 'np.ndarray'
 |      Return the data as an array of :class:`datetime.datetime` objects.
 |
 |      Timezone information is retained if present.
 |
 |      .. warning::
 |
 |         Python's datetime uses microsecond resolution, which is lower than
 |         pandas (nanosecond). The values are truncated.
 |
 |      Returns
 |      -------
 |      numpy.ndarray
 |          Object dtype array containing native Python datetime objects.
 |
 |      See Also
 |      --------
 |      datetime.datetime : Standard library value for a datetime.
 |
 |      Examples
 |      --------
 |      >>> s = pd.Series(pd.date_range('20180310', periods=2))
 |      >>> s
 |      0   2018-03-10
 |      1   2018-03-11
 |      dtype: datetime64[ns]
 |
 |      >>> s.dt.to_pydatetime()
 |      array([datetime.datetime(2018, 3, 10, 0, 0),

# day 23

In [2]:
import numpy as  np 
import pandas as pd

In [3]:
superstore =pd.read_excel("Sample-Superstore-Subset-Excel (2).xlsx")

In [10]:
superstore.head()

,Row ID,Order Priority,Discount,Unit Price,Shipping Cost,Customer ID,Customer Name,Ship Mode,Customer Segment,Product Category,...,Region,State or Province,City,Postal Code,Order Date,Ship Date,Profit,Quantity ordered new,Sales,Order ID
0,18606,Not Specified,0.01,2.88,0.50,2,Janice Fletcher,Regular Air,Corporate,Office Supplies,...,Central,Illinois,Addison,60101,2012-05-28,2012-05-30,1.3200,2,5.90,88525
1,20847,High,0.01,2.84,0.93,3,Bonnie Potter,Express Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2010-07-07,2010-07-08,4.5600,4,13.01,88522
2,23086,Not Specified,0.03,6.68,6.15,3,Bonnie Potter,Express Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2011-07-27,2011-07-28,-47.6400,7,49.92,88523
3,23087,Not Specified,0.01,5.68,3.60,3,Bonnie Potter,Regular Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2011-07-27,2011-07-28,-30.5100,7,41.64,88523
4,23088,Not Specified,0.00,205.99,2.50,3,Bonnie Potter,Express Air,Corporate,Technology,...,West,Washington,Anacortes,98221,2011-07-27,2011-07-27,998.2023,8,1446.67,88523

In [15]:
boolean=superstore["Sales"].between(3000,3999)

needed_data=superstore[boolean]

needed_data["Profit"].mean()

566.9436761831674

In [19]:
superstore.transpose()

,0,1,2,3,4,5,6,7,8,9,...,9416,9417,9418,9419,9420,9421,9422,9423,9424,9425
Row ID,18606,20847,23086,23087,23088,23597,25549,20228,19483,24782,...,24933,23413,23414,24912,18329,20275,20276,24491,25914,24492
Order Priority,Not Specified,High,Not Specified,Not Specified,Not Specified,Medium,Low,Not Specified,Low,High,...,Medium,Critical,Critical,Medium,High,Critical,Critical,Not Specified,High,Not Specified
Discount,0.01,0.01,0.03,0.01,0.0,0.09,0.08,0.02,0.08,0.01,...,0.01,0.07,0.02,0.05,0.08,0.06,0.0,0.08,0.1,0.09
Unit Price,2.88,2.84,6.68,5.68,205.99,55.48,120.97,500.98,6.48,90.24,...,7.64,115.79,37.44,35.99,212.6,35.89,3.34,550.98,105.98,7.78
Shipping Cost,0.5,0.93,6.15,3.6,2.5,14.3,26.3,26.0,6.81,0.99,...,5.83,1.99,4.27,1.25,52.2,14.72,7.49,45.7,13.99,2.5
Customer ID,2,3,3,3,3,3,3,5,5,6,...,3400,3400,3400,3400,3402,3402,3402,3402,3403,3403
Customer Name,Janice Fletcher,Bonnie Potter,Bonnie Potter,Bonnie Potter,Bonnie Potter,Bonnie Potter,Bonnie Potter,Ronnie Proctor,Ronnie Proctor,Dwight Hwang,...,Florence Gold,Florence Gold,Florence Gold,Florence Gold,Frederick Cole,Frederick Cole,Frederick Cole,Frederick Cole,Tammy Buckley,Tammy Buckley
Ship Mode,Regular Air,Express Air,Express Air,Regular Air,Express Air,Express Air,Delivery Truck,Delivery Truck,Regular Air,Regular Air,...,Regular Air,Regular Air,Regular Air,Regular Air,Delivery Truck,Regular Air,Regular Air,Delivery Truck,Express Air,Express Air
Customer Segment,Corporate,Corporate,Corporate,Corporate,Corporate,Corporate,Corporate,Home Office,Home Office,Home Office,...,Corporate,Corporate,Corporate,Small Business,Consumer,Consumer,Consumer,Consumer,Consumer,Consumer
Product Category,Office Supplies,Office Supplies,Office Supplies,Office Supplies,Technology,Office Supplies,Technology,Furniture,Office Supplies,Office Supplies,...,Office Supplies,Technology,Office Supplies,Technology,Furniture,Office Supplies,Office Supplies,Furniture,Furniture,Office Supplies
Product Sub-Category,Labels,Pens & Art Supplies,Paper,"Scissors, Rulers and Trimmers",Telephones and Communication,Paper,Office Machines,Chairs & Chairmats,Paper,Appliances,...,Paper,Computer Peripherals,Pens & Art Supplies,Telephones and Communication,Tables,Envelopes,Pens & Art Supplies,Tables,Office Furnishings,Envelopes
Product Container,Small Box,Wrap Bag,Small Box,Small Pack,Small Box,Small Box,Jumbo Drum,Jumbo Drum,Small Box,Small Box,...,Wrap Bag,Small Pack,Wrap Bag,Small Pack,Jumbo Box,Small Box,Wrap Bag,Jumbo Box,Medium Box,Small Box
Product Name,Avery 49,SANFORD Liquid Accent™ Tank-Style Highlighters,Xerox 1968,Acme® Preferred Stainless Steel Scissors,V70,Xerox 194,Canon S750 Color Inkjet Printer,Global Troy™ Executive Leather Low-Back Tilter,Xerox 1930,Kensington 6 Outlet MasterPiece® HOMEOFFICE Po...,...,"Rediform Wirebound ""Phone Memo"" Message Book, ...","Verbatim DVD-R, 4.7GB, Spindle, WE, Blank, Ink...",Sanford Prismacolor® Professional Thick Lead A...,Accessory23,Bush Advantage Collection® Round Conference Table,Jet-Pak Recycled Peel 'N' Seal Padded Mailers,"Eldon Spacemaker® Box, Quick-Snap Lid, Clear",Chromcraft Bull-Nose Wood Oval Conference Tabl...,"Tenex 46"" x 60"" Computer Anti-Static Chairmat,...",Staples #10 Colored Envelopes
Product Base Margin,0.36,0.54,0.37,0.56,0.59,0.37,0.38,0.6,0.36,0.56,...,0.36,0.49,0.46,0.36,0.64,0.4,0.54,0.71,0.65,0.38
Region,Central,West,West,West,West,West,West,West,West,West,...,East,East,East,East,East,East,East,East,West,West
State or Province,Illinois,Washington,Washington,Washington,Washington,Washington,Washington,California,California,California,...,West Virginia,West Virginia,West Virginia,West Virginia,West Virginia,West Virginia,West Virginia,West Virginia,Wyoming,Wyoming
City,Addison,Anacortes,Anacortes,Anacortes,Anacortes,Anacortes,Anacortes,San Gabriel,San Gabriel,San Jose,...,Fairmont,Fairmont,Fairmont,Fairmont,Charleston,Charleston,Charleston,Charleston,Cheyenne,Cheyenne
Postal Code,60101,98221,98221,98221,98221,98221,98221,91776,91776,95123,...,26554,26554,26554,26554,25314,25314,25314,25314,82001,82001
Order Date,2012-05-28 00:00:00,2010-07-07 00:00:00,2011-07-27 00:00:00,2011-07-27 00:00:00,2011-07-27 00:00:00,2011-11-09 00:00:00,2013-07-01 00:00:00,2010-12-13 00:00:00,2012-05-12 00:00:00,2011-05-26 00:00:00,...,2012-11-29 00:00:00,2013-04-27 00:00:00,2013-04-27 00:00:00,2013-10-04 00:00:00,2011-04-12 00:00:00,2013-05-14 00:00:00,2013-05-14 00:00:00,2013-09-12 00:00:00,2010-02-08 00:00:00,2013-09-12 00:00:00
Ship Date,2012-05-30 00:00:00,2010-07-08 00:00:00,2011-07-28 00:00:00,2011-07-28 00:00:00,2011-07-27 00:00:00,2011-11-11 00:00:00,2013-07-08 00:00:00,2010-12-15 00:00:00,2012-05-21 00:00:00,2011-05-26 00:00:00,...,2012-11-29 00:00:00,2013-04-29 00:00:00,2013-04-30 00:00:00,2013-10-05 00:00:00,2011-04-12 00:00:00,2013-05-15 00:00:00,2013-05-14 00:00:00,2013-09-14 00:00:00,2010-02-11 00:00:00,2013-09-14 00:00:00
Profit,1.32,4.56,-47.64,-30.51,998.2023,1388.0523,1001.4453,4390.3665,-141.26,1045.4673,...,3.312,606.3099,-15.03,411.4815,-513.79042,137.86,-39.07,-1225.029097,349.485,78.0624
Quantity ordered new,2,4,7,7,8,37,12,12,18,16,...,8,8,1,19,10,13,3,4,5,23
Sales,5.9,13.01,49.92,41.64,1446.67,2011.67,1451.37,6362.85,113.25,1515.17,...,67.5,878.71,43.9,596.35,1969.31,447.87,13.23,2215.93,506.5,172.48
Order ID,88525,88522,88523,88523,88523,88524,88526,90193,90197,90194,...,87545,87546,87546,87549,87531,87532,87532,87533,87530,87533

In [18]:
boolean= superstore["Product Sub-Category"] == "Chairs & Chairmats"

needed_data=superstore[boolean]

needed_data["Sales"].sum()

1164584.16

# another method

In [63]:
superstore.loc[superstore["Product Sub-Category"] == "Chairs & Chairmats","Sales"].sum()

1164584.16

# another method

In [65]:

#mind it that whatever you put inside groupby must be a column of the DataFrame
superstore.groupby("Product Sub-Category").sum()["Sales"]

Product Sub-Category
Appliances                         456723.08
Binders and Binder Accessories     638582.09
Bookcases                          507494.49
Chairs & Chairmats                1164584.16
Computer Peripherals               490840.53
Copiers and Fax                    661211.93
Envelopes                          147921.03
Labels                              23449.90
Office Furnishings                 444624.03
Office Machines                   1218656.59
Paper                              253600.31
Pens & Art Supplies                103251.59
Rubber Bands                         8663.77
Scissors, Rulers and Trimmers       40428.87
Storage & Organization             585704.91
Tables                            1061921.06
Telephones and Communication      1144272.98
Name: Sales, dtype: float64

In [20]:
#accessing two columns at once
needed_data[["Sales","Profit"]]

         Sales      Profit
7      6362.85  4390.36650
39     2575.93   126.31000
55    10303.73   126.31000
94      640.97  -162.15032
110    1396.96  -336.38464
...        ...         ...
9348    834.22   -63.40600
9352   2941.42  3193.28400
9386   1852.24   836.70320
9393   3198.10  2206.68900
9395   5043.80  3480.22200

[440 rows x 2 columns]

In [35]:
superstore.corr()

,Row ID,Discount,Unit Price,Shipping Cost,Customer ID,Product Base Margin,Postal Code,Profit,Quantity ordered new,Sales,Order ID
Row ID,1.000000,0.000912,0.007586,0.004780,0.038840,-0.002013,0.033833,-0.006431,-0.574926,-0.220454,0.918587
Discount,0.000912,1.000000,0.001099,-0.002141,-0.005723,0.006801,-0.001707,-0.039467,-0.014062,-0.021286,-0.000055
Unit Price,0.007586,0.001099,1.000000,0.246251,-0.007310,0.061917,0.023104,-0.048559,-0.054415,0.433984,0.009805
Shipping Cost,0.004780,-0.002141,0.246251,1.000000,-0.014462,0.377359,-0.003406,-0.017034,-0.020198,0.310223,0.007070
Customer ID,0.038840,-0.005723,-0.007310,-0.014462,1.000000,-0.020397,-0.086988,0.007962,-0.028248,-0.004937,0.043739
Product Base Margin,-0.002013,0.006801,0.061917,0.377359,-0.020397,1.000000,-0.004380,-0.070798,0.000205,0.117908,0.006821
Postal Code,0.033833,-0.001707,0.023104,-0.003406,-0.086988,-0.004380,1.000000,0.005364,-0.010895,-0.000176,0.037847
Profit,-0.006431,-0.039467,-0.048559,-0.017034,0.007962,-0.070798,0.005364,1.000000,0.124924,0.371583,-0.003428
Quantity ordered new,-0.574926,-0.014062,-0.054415,-0.020198,-0.028248,0.000205,-0.010895,0.124924,1.000000,0.360121,-0.599471
Sales,-0.220454,-0.021286,0.433984,0.310223,-0.004937,0.117908,-0.000176,0.371583,0.360121,1.000000,-0.228260
Order ID,0.918587,-0.000055,0.009805,0.007070,0.043739,0.006821,0.037847,-0.003428,-0.599471,-0.228260,1.000000

In [53]:
#this boolean tries to find the items that have correlation between 0.4 and 0.5

boolean=(superstore.corr()>= 0.4) & (superstore.corr() <= 0.5)
boolean

,Row ID,Discount,Unit Price,Shipping Cost,Customer ID,Product Base Margin,Postal Code,Profit,Quantity ordered new,Sales,Order ID
Row ID,False,False,False,False,False,False,False,False,False,False,False
Discount,False,False,False,False,False,False,False,False,False,False,False
Unit Price,False,False,False,False,False,False,False,False,False,True,False
Shipping Cost,False,False,False,False,False,False,False,False,False,False,False
Customer ID,False,False,False,False,False,False,False,False,False,False,False
Product Base Margin,False,False,False,False,False,False,False,False,False,False,False
Postal Code,False,False,False,False,False,False,False,False,False,False,False
Profit,False,False,False,False,False,False,False,False,False,False,False
Quantity ordered new,False,False,False,False,False,False,False,False,False,False,False
Sales,False,False,True,False,False,False,False,False,False,False,False
Order ID,False,False,False,False,False,False,False,False,False,False,False

In [66]:
superstore.xs(key=((2,3)),level="Customer ID")

TypeError: Index must be a MultiIndex

In [68]:
superstore[superstore["Customer ID"].isin([2,3])]

,Row ID,Order Priority,Discount,Unit Price,Shipping Cost,Customer ID,Customer Name,Ship Mode,Customer Segment,Product Category,...,Region,State or Province,City,Postal Code,Order Date,Ship Date,Profit,Quantity ordered new,Sales,Order ID
0,18606,Not Specified,0.01,2.88,0.50,2,Janice Fletcher,Regular Air,Corporate,Office Supplies,...,Central,Illinois,Addison,60101,2012-05-28,2012-05-30,1.3200,2,5.90,88525
1,20847,High,0.01,2.84,0.93,3,Bonnie Potter,Express Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2010-07-07,2010-07-08,4.5600,4,13.01,88522
2,23086,Not Specified,0.03,6.68,6.15,3,Bonnie Potter,Express Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2011-07-27,2011-07-28,-47.6400,7,49.92,88523
3,23087,Not Specified,0.01,5.68,3.60,3,Bonnie Potter,Regular Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2011-07-27,2011-07-28,-30.5100,7,41.64,88523
4,23088,Not Specified,0.00,205.99,2.50,3,Bonnie Potter,Express Air,Corporate,Technology,...,West,Washington,Anacortes,98221,2011-07-27,2011-07-27,998.2023,8,1446.67,88523
5,23597,Medium,0.09,55.48,14.30,3,Bonnie Potter,Express Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2011-11-09,2011-11-11,1388.0523,37,2011.67,88524
6,25549,Low,0.08,120.97,26.30,3,Bonnie Potter,Delivery Truck,Corporate,Technology,...,West,Washington,Anacortes,98221,2013-07-01,2013-07-08,1001.4453,12,1451.37,88526

In [1]:
import pandas as pd
import numpy  as np

In [2]:
superstore =pd.read_excel("Sample-Superstore-Subset-Excel (2).xlsx")

In [6]:
superstore.groupby(["Product Category","Product Sub-Category"]).mean()

                                                       Row ID  Discount  \
Product Category Product Sub-Category
Furniture        Bookcases                       20376.276699  0.047427
                 Chairs & Chairmats              20101.813636  0.050136
                 Office Furnishings              20312.121178  0.048482
                 Tables                          20433.650990  0.050594
Office Supplies  Appliances                      19918.656504  0.050752
                 Binders and Binder Accessories  20297.427043  0.050282
                 Envelopes                       20514.613971  0.049228
                 Labels                          19790.334347  0.049210
                 Paper                           20265.427846  0.049246
                 Pens & Art Supplies             19990.213592  0.051512
                 Rubber Bands                    21095.492308  0.051436
                 Scissors, Rulers and Trimmers   20830.593548  0.048645
                 Storage & Organization          20264.427869  0.051082
Technology       Computer Peripherals            20239.404255  0.048641
                 Copiers and Fax                 20147.969388  0.051735
                 Office Machines                 20449.843085  0.050718
                 Telephones and Communication    20114.073589  0.047782

                                                 Unit Price  Shipping Cost  \
Product Category Product Sub-Category
Furniture        Bookcases                       172.680971      45.710534
                 Chairs & Chairmats              185.228364      40.274318
                 Office Furnishings               33.789287      10.550091
                 Tables                          218.697970      56.888911
Office Supplies  Appliances                       72.381728      15.955589
                 Binders and Binder Accessories   58.500477       7.256031
                 Envelopes                        27.530000       6.924632
                 Labels                            5.393343       0.973921
                 Paper                            14.115381       6.410761
                 Pens & Art Supplies               9.529015       3.223454
                 Rubber Bands                      3.024769       1.262718
                 Scissors, Rulers and Trimmers    39.849871       4.551871
                 Storage & Organization           79.032689      17.791639
Technology       Computer Peripherals             42.478428       5.414137
                 Copiers and Fax                 747.438980      27.585918
                 Office Machines                 544.010931      21.045984
                 Telephones and Communication     97.811573       5.535817

                                                 Customer ID  \
Product Category Product Sub-Category
Furniture        Bookcases                       1789.436893
                 Chairs & Chairmats              1742.643182
                 Office Furnishings              1706.661382
                 Tables                          1640.732673
Office Supplies  Appliances                      1758.388211
                 Binders and Binder Accessories  1805.070039
                 Envelopes                       1705.500000
                 Labels                          1765.604863
                 Paper                           1739.064540
                 Pens & Art Supplies             1767.077670
                 Rubber Bands                    1819.497436
                 Scissors, Rulers and Trimmers   1645.245161
                 Storage & Organization          1745.544262
Technology       Computer Peripherals            1757.906619
                 Copiers and Fax                 1768.969388
                 Office Machines                 1655.202128
                 Telephones and Communication    1699.485887

                                                 Product Base Margin  \
Product Category Product Sub-Category
Furniture        Bookcases                                  0.660050
                 Chairs & Chairmats                         0.637139
                 Office Furnishings                         0.524609
                 Tables                                     0.691811
Office Supplies  Appliances                                 0.554878
                 Binders and Binder Accessories             0.374095
                 Envelopes                                  0.373750
                 Labels                                     0.376809
                 Paper                                      0.374975
                 Pens & Art Supplies                        0.533384
                 Rubber Bands                               0.523538
                 Scissors, Rulers and Trimmers              0.642323
                 Storage & Organization                     0.665973
Technology       Computer Peripherals                       0.592092
                 Copiers and Fax                            0.421020
                 Office Machines                            0.445851
                 Telephones and Communication               0.581411

                                                  Postal Code       Profit  \
Product Category Product Sub-Category
Furniture        Bookcases                       56426.203883   -37.421110
                 Chairs & Chairmats              51428.381818   375.792915
                 Office Furnishings              53146.569649   104.427209
                 Tables                          50888.710396  -179.443222
Office Supplies  Appliances                      51692.587398   247.258926
                 Binders and Binder Accessories  52198.373541   220.401287
                 Envelopes                       52701.500000   169.607441
                 Labels                          51742.355623    54.028330
                 Paper                           52512.498187    25.642945
                 Pens & Art Supplies             51831.090153     1.658672
                 Rubber Bands                    51575.620513   -14.572936
                 Scissors, Rulers and Trimmers   55835.161290   -12.495801
                 Storage & Organization          50876.427869    13.243942
Technology       Computer Peripherals            52058.278960   103.921800
                 Copiers and Fax                 52845.836735  1317.925347
                 Office Machines                 55185.058511   447.002216
                 Telephones and Communication    53092.303427   300.353352

                                                 Quantity ordered new  \
Product Category Product Sub-Category
Furniture        Bookcases                                  13.077670
                 Chairs & Chairmats                         14.375000
                 Office Furnishings                         14.095130
                 Tables                                     12.839109
Office Supplies  Appliances                                 14.308943
                 Binders and Binder Accessories             12.878405
                 Envelopes                                  14.555147
                 Labels                                     14.571429
                 Paper                                      13.670776
                 Pens & Art Supplies                        14.912621
                 Rubber Bands                               14.128205
                 Scissors, Rulers and Trimmers              12.993548
                 Storage & Organization                     13.339344
Technology       Computer Peripherals                       13.871158
                 Copiers and Fax                            12.010204
                 Office Machines                            12.430851
                 Telephones and Communication               14.399194

                                                       Sales      Order ID
Product Category Product Sub-Category
Furniture        Bookcases                       2463.565485  83674.165049
                 Chairs & Chairmats              2646.782182  81633.204545
                 Office Furnishings               503.537973  82714.100793
                 Tables                          2628.517475  82580.772277
Office Supplies  Appliances                       928.298943  81379.284553
                 Binders and Binder Accessories   621.188804  82207.815175
                 Envelopes                        543.827316  82841.621324
                 Labels                            71.276292  80756.370821
                 Paper                            183.901603  82180.485134
                 Pens & Art Supplies              143.206089  81538.832178
                 Rubber Bands                      44.429590  84290.466667
                 Scissors, Rulers and Trimmers    260.831419  84322.658065
                 Storage & Organization           960.171984  82691.619672
Technology       Computer Peripherals             580.189752  82619.455083
                 Copiers and Fax                 6747.060510  82663.244898
                 Office Machines                 3241.107952  82896.686170
                 Telephones and Communication    1153.500988  82155.503024

In [7]:
superstore["State or Province"].value_counts()

California              1021
Texas                    646
Illinois                 584
New York                 574
Florida                  522
Ohio                     396
Washington               327
Michigan                 327
Pennsylvania             271
North Carolina           251
Indiana                  241
Minnesota                239
Massachusetts            222
Georgia                  214
Virginia                 198
Maryland                 178
Colorado                 177
New Jersey               177
Wisconsin                169
Oregon                   168
Tennessee                166
Missouri                 161
Iowa                     156
Utah                     146
Arizona                  134
Kansas                   133
Maine                    128
Alabama                  125
Arkansas                 123
Idaho                    114
South Carolina           105
Oklahoma                 104
Louisiana                 89
New Mexico                84
Kentucky                  83
Connecticut               82
Mississippi               78
Nebraska                  77
District of Columbia      68
Vermont                   61
New Hampshire             54
Montana                   49
West Virginia             43
Nevada                    43
North Dakota              34
South Dakota              28
Wyoming                   21
Rhode Island              20
Delaware                  15
Name: State or Province, dtype: int64

In [11]:
superstore.agg({"Profit":["sum","mean","min","max"],"Sales":["sum","mean"]   }).dropna(axis=0)

            Profit         Sales
sum   1.312442e+06  8.951931e+06
mean  1.392364e+02  9.497063e+02

# current working directory

In [13]:
pwd

'C:\\Users\\ADMIN\\for machine learning\\python'

In [14]:
import os

os.getcwd() # get current working directory

'C:\\Users\\ADMIN\\for machine learning\\python'

In [16]:
df=pd.read_csv("example.csv",index_col=)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# writing to a new csv file from python

In [19]:
df.to_csv("newfile.csv",index=False)

In [20]:
new=pd.read_csv("newfile.csv")
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# extracting data from a website

In [21]:
url="https://en.wikipedia.org/wiki/World_population"

In [22]:
tables=pd.read_html(url) 
# it returns a list of tables from the website

In [24]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1930,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",126,30,14,13,12,12,11,15,20

In [25]:
len(tables)

24

In [28]:
top10=tables[1]

top10

,#,Most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

# cleaning the table to remove unwanted rows and columns

In [30]:
top10=top10.drop("#",axis=1)
top10

,Most populous countries,2000,2015,2030[A]
0,China[B],1270,1376,1416
1,India,1053,1311,1528
2,United States,283,322,356
3,Indonesia,212,258,295
4,Pakistan,136,208,245
5,Brazil,176,206,228
6,Nigeria,123,182,263
7,Bangladesh,131,161,186
8,Russia,146,146,149
9,Mexico,103,127,148
10,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

# dropping the eleventh row

In [31]:
top10.drop(11,axis=0)

   Most populous countries  2000  2015 2030[A]
0                 China[B]  1270  1376    1416
1                    India  1053  1311    1528
2            United States   283   322     356
3                Indonesia   212   258     295
4                 Pakistan   136   208     245
5                   Brazil   176   206     228
6                  Nigeria   123   182     263
7               Bangladesh   131   161     186
8                   Russia   146   146     149
9                   Mexico   103   127     148
10             World total  6127  7349    8501

# remember axis=0 row, axis=1 column

# changing the columns names

In [33]:
top10.columns=["Countries","2000","2015","2030"]
top10

,Countries,2000,2015,2030
0,China[B],1270,1376,1416
1,India,1053,1311,1528
2,United States,283,322,356
3,Indonesia,212,258,295
4,Pakistan,136,208,245
5,Brazil,176,206,228
6,Nigeria,123,182,263
7,Bangladesh,131,161,186
8,Russia,146,146,149
9,Mexico,103,127,148
10,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [34]:
top10=top10.drop(11,axis=0)
top10

        Countries  2000  2015  2030
0        China[B]  1270  1376  1416
1           India  1053  1311  1528
2   United States   283   322   356
3       Indonesia   212   258   295
4        Pakistan   136   208   245
5          Brazil   176   206   228
6         Nigeria   123   182   263
7      Bangladesh   131   161   186
8          Russia   146   146   149
9          Mexico   103   127   148
10    World total  6127  7349  8501

# removing "B" from china

In [43]:
top10=top10.replace(to_replace="China[B]",value="China")
top10

        Countries  2000  2015  2030
0           China  1270  1376  1416
1           India  1053  1311  1528
2   United States   283   322   356
3       Indonesia   212   258   295
4        Pakistan   136   208   245
5          Brazil   176   206   228
6         Nigeria   123   182   263
7      Bangladesh   131   161   186
8          Russia   146   146   149
9          Mexico   103   127   148
10    World total  6127  7349  8501

# next data

In [86]:
test=tables[6]
test

,Year,Population,%,Yearly growth,Density(pop/km2),Urban population,%
0,1951,2584034261,1.88%,47603112,17,775067697,30%
1,1952,2630861562,1.81%,46827301,18,799282533,30%
2,1953,2677608960,1.78%,46747398,18,824289989,31%
3,1954,2724846741,1.76%,47237781,18,850179106,31%
4,1955,2773019936,1.77%,48173195,19,877008842,32%
...,...,...,...,...,...,...,...
65,2016,7464022000,1.14%,84225000,50,4060653000,54%
66,2017,7547859000,1.12%,83837000,51,4140189000,55%
67,2018,7631091000,1.10%,83232000,51,4219817000,55%
68,2019,7713468000,1.08%,82377000,52,4299439000,56%
69,2020,7795000000,1.05%,81331000,52,4378900000,56%

In [87]:
test.columns

Index(['Year', 'Population', '%', 'Yearly growth', 'Density(pop/km2)',
       'Urban population', '%'],
      dtype='object')

# we can see that the DataFrame test has multilevel indexes now we want to flatten it

In [88]:
test.columns=test.columns.get_level_values(0) # it flattens the column

#note it is test.columns not just test
test

,Year,Population,%,Yearly growth,Density(pop/km2),Urban population,%
0,1951,2584034261,1.88%,47603112,17,775067697,30%
1,1952,2630861562,1.81%,46827301,18,799282533,30%
2,1953,2677608960,1.78%,46747398,18,824289989,31%
3,1954,2724846741,1.76%,47237781,18,850179106,31%
4,1955,2773019936,1.77%,48173195,19,877008842,32%
...,...,...,...,...,...,...,...
65,2016,7464022000,1.14%,84225000,50,4060653000,54%
66,2017,7547859000,1.12%,83837000,51,4140189000,55%
67,2018,7631091000,1.10%,83232000,51,4219817000,55%
68,2019,7713468000,1.08%,82377000,52,4299439000,56%
69,2020,7795000000,1.05%,81331000,52,4378900000,56%

# further pruning

In [89]:
test.columns=["Year","Population","%","Yearly growth","Density(pop/km2)","Urban population","%"]
test

,Year,Population,%,Yearly growth,Density(pop/km2),Urban population,%
0,1951,2584034261,1.88%,47603112,17,775067697,30%
1,1952,2630861562,1.81%,46827301,18,799282533,30%
2,1953,2677608960,1.78%,46747398,18,824289989,31%
3,1954,2724846741,1.76%,47237781,18,850179106,31%
4,1955,2773019936,1.77%,48173195,19,877008842,32%
...,...,...,...,...,...,...,...
65,2016,7464022000,1.14%,84225000,50,4060653000,54%
66,2017,7547859000,1.12%,83837000,51,4140189000,55%
67,2018,7631091000,1.10%,83232000,51,4219817000,55%
68,2019,7713468000,1.08%,82377000,52,4299439000,56%
69,2020,7795000000,1.05%,81331000,52,4378900000,56%

# save the file

In [84]:
test.to_html("world_population",index=False)

In [85]:
test=read_csv("world_population")

                   <table border="1" class="dataframe">
0                                               <thead>
1                       <tr style="text-align: right;">
2           <th>&lt;table border="1" class="datafram...
3                                                 </tr>
4                                              </thead>
...                                                 ...
2148                                               <tr>
2149                            <td>&lt;/table&gt;</td>
2150                                              </tr>
2151                                           </tbody>
2152                                           </table>

[2153 rows x 1 columns]

# this went awkward

In [90]:
top10

        Countries  2000  2015  2030
0           China  1270  1376  1416
1           India  1053  1311  1528
2   United States   283   322   356
3       Indonesia   212   258   295
4        Pakistan   136   208   245
5          Brazil   176   206   228
6         Nigeria   123   182   263
7      Bangladesh   131   161   186
8          Russia   146   146   149
9          Mexico   103   127   148
10    World total  6127  7349  8501

# lets store top10

In [91]:
top10.to_html("world population top 10")

# it also went awkward i don't know what to do with that but lets move on

# day 24

# dealing with pivot tables

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("Sales_Funnel_CRM.csv")

In [3]:
df

,Account Number,Company,Contact,Account Manager,Product,Licenses,Sale Price,Status
0,2123398,Google,Larry Pager,Edward Thorp,Analytics,150,2100000,Presented
1,2123398,Google,Larry Pager,Edward Thorp,Prediction,150,700000,Presented
2,2123398,Google,Larry Pager,Edward Thorp,Tracking,300,350000,Under Review
3,2192650,BOBO,Larry Pager,Edward Thorp,Analytics,150,2450000,Lost
4,420496,IKEA,Elon Tusk,Edward Thorp,Analytics,300,4550000,Won
5,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Analytics,300,2800000,Under Review
6,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Prediction,150,700000,Presented
7,1216870,Microsoft,Will Grates,Edward Thorp,Tracking,300,350000,Under Review
8,2200450,Walmart,Will Grates,Edward Thorp,Analytics,150,2450000,Lost
9,405886,Apple,Cindy Phoner,Claude Shannon,Analytics,300,4550000,Won
10,470248,Exxon Mobile,Cindy Phoner,Claude Shannon,Analytics,150,2100000,Presented
11,698032,ATT,Cindy Phoner,Claude Shannon,Tracking,150,350000,Under Review
12,698032,ATT,Cindy Phoner,Claude Shannon,Prediction,150,700000,Presented
13,902797,CVS Health,Emma Gordian,Claude Shannon,Tracking,450,490000,Won
14,2046943,Salesforce,Emma Gordian,Claude Shannon,Analytics,750,7000000,Won
15,2169499,Cisco,Emma Gordian,Claude Shannon,Analytics,300,4550000,Lost
16,2169499,Cisco,Emma Gordian,Claude Shannon,GPS Positioning,300,350000,Presented

In [4]:
licenses=df[["Company","Product","Licenses"]]

licenses

         Company          Product  Licenses
0         Google        Analytics       150
1         Google       Prediction       150
2         Google         Tracking       300
3           BOBO        Analytics       150
4           IKEA        Analytics       300
5     Tesla Inc.        Analytics       300
6     Tesla Inc.       Prediction       150
7      Microsoft         Tracking       300
8        Walmart        Analytics       150
9          Apple        Analytics       300
10  Exxon Mobile        Analytics       150
11           ATT         Tracking       150
12           ATT       Prediction       150
13    CVS Health         Tracking       450
14    Salesforce        Analytics       750
15         Cisco        Analytics       300
16         Cisco  GPS Positioning       300

In [5]:
help(pd.pivot)

Help on function pivot in module pandas.core.reshape.pivot:

pivot(data: 'DataFrame', index: 'IndexLabel | None' = None, columns: 'IndexLabel | None' = None, values: 'IndexLabel | None' = None) -> 'DataFrame'
    Return reshaped DataFrame organized by given index / column values.

    Reshape data (produce a "pivot" table) based on column values. Uses
    unique values from specified `index` / `columns` to form axes of the
    resulting DataFrame. This function does not support data
    aggregation, multiple values will result in a MultiIndex in the
    columns. See the :ref:`User Guide <reshaping>` for more on reshaping.

    Parameters
    ----------
    data : DataFrame
    index : str or object or a list of str, optional
        Column to use to make new frame's index. If None, uses
        existing index.

        .. versionchanged:: 1.1.0
           Also accept list of index names.

    columns : str or object or a list of str
        Column to use to make new frame's columns.

        .. versionchanged:: 1.1.0
           Also accept list of columns names.

    values : str, object or a list of the previous, optional
        Column(s) to use for populating new frame's values. If not
        specified, all remaining columns will be used and the result will
        have hierarchically indexed columns.

    Returns
    -------
    DataFrame
        Returns reshaped DataFrame.

    Raises
    ------
    ValueError:
        When there are any `index`, `columns` combinations with multiple
        values. `DataFrame.pivot_table` when you need to aggregate.

    See Also
    --------
    DataFrame.pivot_table : Generalization of pivot that can handle
        duplicate values for one index/column pair.
    DataFrame.unstack : Pivot based on the index values instead of a
        column.
    wide_to_long : Wide panel to long format. Less flexible but more
        user-friendly than melt.

    Notes
    -----
    For finer-tuned control, see hierarchical indexing documentation along
    with the related stack/unstack methods.

    Reference :ref:`the user guide <reshaping.pivot>` for more examples.

    Examples
    --------
    >>> df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
    ...                            'two'],
    ...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    ...                    'baz': [1, 2, 3, 4, 5, 6],
    ...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
    >>> df
        foo   bar  baz  zoo
    0   one   A    1    x
    1   one   B    2    y
    2   one   C    3    z
    3   two   A    4    q
    4   two   B    5    w
    5   two   C    6    t

    >>> df.pivot(index='foo', columns='bar', values='baz')
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar')['baz']
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])
          baz       zoo
    bar   A  B  C   A  B  C
    foo
    one   1  2  3   x  y  z
    two   4  5  6   q  w  t

    You could also assign a list of column names or a list of index names.

    >>> df = pd.DataFrame({
    ...        "lev1": [1, 1, 1, 2, 2, 2],
    ...        "lev2": [1, 1, 2, 1, 1, 2],
    ...        "lev3": [1, 2, 1, 2, 1, 2],
    ...        "lev4": [1, 2, 3, 4, 5, 6],
    ...        "values": [0, 1, 2, 3, 4, 5]})
    >>> df
        lev1 lev2 lev3 lev4 values
    0   1    1    1    1    0
    1   1    1    2    2    1
    2   1    2    1    3    2
    3   2    1    2    4    3
    4   2    1    1    5    4
    5   2    2    2    6    5

    >>> df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")
    lev2    1         2
    lev3    1    2    1    2
    lev1
    1     0.0  1.0  2.0  NaN
    2     4.0  3.0  NaN  5.0

    >>> df.pivot(index=["lev1", "lev2"], columns=["lev3"],values="values")
          lev3    1    2
    lev1  lev2
       1     1  0.0  1.0
             2  2.0  NaN
       2     1  4.0  3.0
             2  NaN  5.0

    A ValueError is raised if there are any duplicates.

    >>> df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
    ...                    "bar": ['A', 'A', 'B', 'C'],
    ...                    "baz": [1, 2, 3, 4]})
    >>> df
       foo bar  baz
    0  one   A    1
    1  one   A    2
    2  two   B    3
    3  two   C    4

    Notice that the first two rows are the same for our `index`
    and `columns` arguments.

    >>> df.pivot(index='foo', columns='bar', values='baz')
    Traceback (most recent call last):
       ...
    ValueError: Index contains duplicate entries, cannot reshape

In [7]:
pd.pivot(data=licenses,index="Company",columns="Product",values="Licenses")

Product       Analytics  GPS Positioning  Prediction  Tracking
Company
 Google           150.0              NaN       150.0     300.0
ATT                 NaN              NaN       150.0     150.0
Apple             300.0              NaN         NaN       NaN
BOBO              150.0              NaN         NaN       NaN
CVS Health          NaN              NaN         NaN     450.0
Cisco             300.0            300.0         NaN       NaN
Exxon Mobile      150.0              NaN         NaN       NaN
IKEA              300.0              NaN         NaN       NaN
Microsoft           NaN              NaN         NaN     300.0
Salesforce        750.0              NaN         NaN       NaN
Tesla Inc.        300.0              NaN       150.0       NaN
Walmart           150.0              NaN         NaN       NaN

# lets see how pivot_table works

In [9]:
pd.pivot_table(data=df,index="Company",aggfunc="sum")

              Account Number  Licenses  Sale Price
Company
 Google              6370194       600     3150000
ATT                  1396064       300     1050000
Apple                 405886       300     4550000
BOBO                 2192650       150     2450000
CVS Health            902797       450      490000
Cisco                4338998       600     4900000
Exxon Mobile          470248       150     2100000
IKEA                  420496       300     4550000
Microsoft            1216870       300      350000
Salesforce           2046943       750     7000000
Tesla Inc.           1273370       450     3500000
Walmart              2200450       150     2450000

# another way to do the same

In [17]:
test=df.groupby(["Company", "Account Number"]).sum()
test

                             Licenses  Sale Price
Company      Account Number
 Google      2123398              600     3150000
ATT          698032               300     1050000
Apple        405886               300     4550000
BOBO         2192650              150     2450000
CVS Health   902797               450      490000
Cisco        2169499              600     4900000
Exxon Mobile 470248               150     2100000
IKEA         420496               300     4550000
Microsoft    1216870              300      350000
Salesforce   2046943              750     7000000
Tesla Inc.   636685               450     3500000
Walmart      2200450              150     2450000

# usefulness of pivot_table is in being able to mention exactly the values that you want the sum operation to be performed on

In [21]:
# please do be mindful that the in 'sum' 's' is small

pd.pivot_table(data=df,index="Company",aggfunc= "sum",values=["Licenses","Sale Price"])

              Licenses  Sale Price
Company
 Google            600     3150000
ATT                300     1050000
Apple              300     4550000
BOBO               150     2450000
CVS Health         450      490000
Cisco              600     4900000
Exxon Mobile       150     2100000
IKEA               300     4550000
Microsoft          300      350000
Salesforce         750     7000000
Tesla Inc.         450     3500000
Walmart            150     2450000

In [31]:
pd.pivot_table(data=df,index=["Account Manager","Contact","Company"],values="Sale Price",aggfunc=["sum","mean"])

                                                 sum       mean
                                          Sale Price Sale Price
Account Manager Contact      Company
Claude Shannon  Cindy Phoner ATT             1050000     525000
                             Apple           4550000    4550000
                             Exxon Mobile    2100000    2100000
                Emma Gordian CVS Health       490000     490000
                             Cisco           4900000    2450000
                             Salesforce      7000000    7000000
Edward Thorp    Elon Tusk    IKEA            4550000    4550000
                             Tesla Inc.      3500000    1750000
                Larry Pager   Google         3150000    1050000
                             BOBO            2450000    2450000
                Will Grates  Microsoft        350000     350000
                             Walmart         2450000    2450000

In [ ]:
# we can also use np.sum instead of sum

In [32]:
pd.pivot_table(data=df,index=["Account Manager","Contact","Company"],values="Sale Price",aggfunc=[np.sum,np.mean])

                                                 sum       mean
                                          Sale Price Sale Price
Account Manager Contact      Company
Claude Shannon  Cindy Phoner ATT             1050000     525000
                             Apple           4550000    4550000
                             Exxon Mobile    2100000    2100000
                Emma Gordian CVS Health       490000     490000
                             Cisco           4900000    2450000
                             Salesforce      7000000    7000000
Edward Thorp    Elon Tusk    IKEA            4550000    4550000
                             Tesla Inc.      3500000    1750000
                Larry Pager   Google         3150000    1050000
                             BOBO            2450000    2450000
                Will Grates  Microsoft        350000     350000
                             Walmart         2450000    2450000

# margins=True gives grand total at the bottom

In [39]:
pd.pivot_table(data=df,index=["Account Manager","Contact","Company","Product"],values="Sale Price",aggfunc=[np.sum],\
               margins=True)

                                                                 sum
                                                          Sale Price
Account Manager Contact      Company      Product
Claude Shannon  Cindy Phoner ATT          Prediction          700000
                                          Tracking            350000
                             Apple        Analytics          4550000
                             Exxon Mobile Analytics          2100000
                Emma Gordian CVS Health   Tracking            490000
                             Cisco        Analytics          4550000
                                          GPS Positioning     350000
                             Salesforce   Analytics          7000000
Edward Thorp    Elon Tusk    IKEA         Analytics          4550000
                             Tesla Inc.   Analytics          2800000
                                          Prediction          700000
                Larry Pager   Google      Analytics          2100000
                                          Prediction          700000
                                          Tracking            350000
                             BOBO         Analytics          2450000
                Will Grates  Microsoft    Tracking            350000
                             Walmart      Analytics          2450000
All                                                         36540000